Revit 2027 API
PointCloudFilterUtils Class
 Utilities specific to point cloud filters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudFilterUtils
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PointCloudFilterUtils
Public NotInheritable Class PointCloudFilterUtils
public ref class PointCloudFilterUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointCloudFilterUtils = class end
The PointCloudFilterUtils type exposes the following members.
Methods
Name | Description
GetFilteredOutline |  Computes outline of a part of a box that satisfies given PointCloudFilter.
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace